import area from '@/assets/js/area';

const util = {};
util.echartsFormat = (columnMap, dataResult) => {
    const object = {
        tCloumns: [],
        datas: {
            xData: [],
            yData: [],
            legend: [],
            min: '',
            max: '',
        },
    };
    const series = {};
    const keys = [];
    let valueKey;
    const reg = new RegExp(columnMap.regExp);
    Object.keys(columnMap).forEach((key) => {
        if (key !== 'x' && key !== columnMap.x && !reg.test(key) && key !== 'regExp') {
            object.tCloumns.push({
                prop: key,
                label: key === 'dt' ? '时间' : columnMap[key],
            });
            keys.push(key);
        }
        if (reg.test(key)) {
            valueKey = key;
        }
    });
    if (keys.length > 0) {
        dataResult.forEach((o, i) => {
            if (i === 0) {
                object.datas.min = o[valueKey];
                object.datas.max = o[valueKey];
            } else {
                if (o[valueKey] < object.datas.min) object.datas.min = o[valueKey];
                if (o[valueKey] > object.datas.max) object.datas.max = o[valueKey];
            }
            if (object.datas.xData.indexOf(o.dt) === -1) {
                object.datas.xData.push(o.dt);
            }
            let str = '';
            keys.forEach((v) => {
                str += o[v];
            });
            if (!series[str]) {
                object.datas.legend.push(str);
                series[str] = {};
                series[str].arr = [];
            }
            if (series[str]) {
                series[str][o.dt] = o[valueKey];
            }
        });
        object.datas.xData.forEach((v) => {
            Object.keys(series).forEach((key) => {
                const data = series[key][v] ? series[key][v] : 0;
                series[key].arr.push(data);
            });
        });
        Object.keys(series).forEach((key) => {
            object.datas.yData.push(series[key].arr);
        });
    } else {
        series.arr = [];
        dataResult.forEach((data, i) => {
            if (i === 0) {
                object.datas.min = data[valueKey];
                object.datas.max = data[valueKey];
            } else {
                if (data[valueKey] < object.datas.min) object.datas.min = data[valueKey];
                if (data[valueKey] > object.datas.max) object.datas.max = data[valueKey];
            }
            if (object.datas.xData.indexOf(data.dt) === -1) {
                object.datas.xData.push(data.dt);
            }
            series.arr.push(data[valueKey]);
        });
        object.datas.legend.push(columnMap[valueKey]);
        object.datas.yData.push(series.arr);
    }
    return object;
};
util.deleCookies = () => {
    const myDate = new Date();
    myDate.setTime(-1000); // 设置时间
    const data = document.cookie;
    const dataArray = data.split('; ');
    for (let i = 0; i < dataArray.length; i += 1) {
        const varName = dataArray[i].split('=');
        document.cookie = `${varName[0]}=''; expires=${myDate.toGMTString()}`;
        console.log(dataArray[i]);
    }
    const domain = document.domain.replace(/^\w*\./, '');
    document.cookie = `_TOKEN_KEY_='';domain=${domain}`;
};

util.tableSearch = ({ selection = false, pageSize = 10, currentPage = 1, total = 0, order = '', prop = '' } = {}) => ({
    pageSize,
    currentPage,
    total,
    order,
    prop,
    selection,
});
// util.selection = ({ selection = [] } = {}) => ({
//   selection,
// });

util.address2area = (address, editable) => {

    let addStr = address;

    let provinces = area.province;
    let cities = area.city;
    let districts = area.district;

    if (editable) {
        let province;
        let city;
        let district;
        let provinceStr = '';
        let cityStr = '';
        let districtStr = '';

        let idxA = addStr.indexOf('省');
        let idxB = addStr.indexOf('自治区');
        let idxC = addStr.indexOf('特别行政区');

        let idxD = addStr.indexOf('市');
        let idxE = addStr.indexOf('自治州');
        let idxF = addStr.indexOf('地区');
        let idxG = addStr.indexOf('盟');

        let idxH = addStr.indexOf('区');
        let idxI = addStr.indexOf('县');
        let idxJ = addStr.indexOf('旗');
        let idxK = addStr.indexOf('市');

        let pIndex, pLen;
        let cIndex, cLen;
        let dIndex, dLen;
        if (idxA !== -1) {
            pIndex = idxA;
            pLen = 1;
        } else if (idxB !== -1) {
            pIndex = idxB;
            pLen = 3;
        } else if (idxC !== -1) {
            pIndex = idxC;
            pLen = 5;
        } else {
            pIndex = -1;
        }

        if (idxD !== -1) {
            cIndex = idxD;
            cLen = 1;
        } else if (idxE !== -1) {
            cIndex = idxE;
            cLen = 3;
        } else if (idxF !== -1) {
            cIndex = idxF;
            cLen = 2;
        } else if (idxG !== -1) {
            cIndex = idxG;
            cLen = 1;
        } else {
            cIndex = -1;
        }

        if (idxH !== -1) {
            dIndex = idxH;
            dLen = 1;
        } else if (idxI !== -1) {
            dIndex = idxI;
            dLen = 1;
        } else if (idxJ !== -1) {
            dIndex = idxJ;
            dLen = 1;
        } else if (idxK !== -1) {
            dIndex = idxK;
            dLen = 1;
        } else {
            dIndex = -1;
        }

        if (dIndex !== -1) {
            if (idxF !== -1) {
                dIndex = addStr.substring(idxF + pLen).indexOf('区');
            } else if (idxB !== -1) {
                dIndex = addStr.substring(idxB + pLen).indexOf('区');
            } else if (idxC !== -1) {
                dIndex = addStr.substring(idxC + pLen).indexOf('区');
            }
        }

        province = addStr.substring(0, pIndex + pLen);
        city = addStr.substring(pIndex + pLen, cIndex + cLen);
        district = addStr.substring(cIndex + cLen, dIndex + dLen);

        let addressStr = (dIndex !== -1 ? addStr.substring(dIndex + dLen) : '');

        let pId, cId;
        let isMunicipality = false;
        let isSpecialZone = false;

        return {
            lv_1: province, lv_2: city, lv_3: district, lv_4: addressStr,
        };
    } else {
        return addStr;
    }
};

// 深度拷贝
util.deepClone = (obj) => {
    if (!obj || (typeof obj !== 'object')) return obj;

    const clone = (obj) => {
        let _obj = {};
        if (obj.constructor === Object) {
            _obj = {};
            for (let k in obj) {
                if (obj[k] && (obj[k].constructor === Object || obj[k].constructor === Array)) {
                    _obj[k] = clone(obj[k]);
                } else {
                    _obj[k] = obj[k];
                }
            }
        } else if (obj.constructor === Array) {
            _obj = [];
            const len = obj.length;
            for (let i = 0; i < len; i++) {
                if (obj[i] && (obj[i].constructor === Array || obj[i].constructor === Object)) {
                    _obj.push(clone(obj[i]));
                } else {
                    _obj.push(obj[i]);
                }
            }
        } else {
            _obj = obj;
        }

        return _obj;
    };

    return clone(obj);
};

// 数组去重，仅针对基本数据类型
util.unique = (obj, idxs) => {
    if (!obj || obj.constructor !== Array) {
        return obj;
    }

    let dt = {};
    let arr = [];
    let len = obj.length;
    for (let i = 0; i < len; i += 1) {
        if (idxs && idxs.constructor === Array && dt['key_' + obj[i]] === obj[i]) {
            idxs.push(i);
        }
        dt['key_' + obj[i]] = obj[i];
    }

    for (let k in dt) {
        arr.push(dt[k]);
    }

    return arr;
};

util.getOrganization = (obj,arr)=>{
  arr.push({ name: obj.orgName, id: obj.id });
  if (obj.parentOrganization) {
    return util.getOrganization(obj.parentOrganization, arr);
  } else {
    return arr;
  }
}
util.getCity = ()=>{
    const city = {
        阿克苏地区: [80.260604, 41.168779],
        和田地区: [79.922211, 37.114157],
        上海市: [121.480237, 31.236305],
        东莞市: [113.758231, 23.026997],
        东营市: [118.588614, 37.454925],
        中山市: [113.399023, 22.522262],
        临汾市: [111.526153, 36.094052],
        临沂市: [118.36299, 35.110531],
        丹东市: [124.362564, 40.00569],
        丽水市: [119.929503, 28.472979],
        乌鲁木齐市: [87.623314, 43.832806],
        佛山市: [113.128432, 23.027707],
        保定市: [115.471052, 38.880055],
        兰州市: [103.840692, 36.067312],
        包头市: [109.846755, 40.663636],
        北京市: [116.413554, 39.911013],
        北海市: [109.126614, 21.486955],
        南京市: [118.802891, 32.064735],
        南宁市: [108.373351, 22.823037],
        南昌市: [115.864528, 28.687675],
        南通市: [120.900301, 31.985237],
        厦门市: [118.095915, 24.485821],
        台州市: [121.426996, 28.662297],
        合肥市: [117.235447, 31.82687],
        呼和浩特市: [111.758518, 40.847461],
        咸阳市: [108.715712, 34.335599],
        哈尔滨市: [126.542417, 45.807782],
        唐山市: [118.187036, 39.636673],
        嘉兴市: [120.762045, 30.750912],
        大同市: [113.306446, 40.082539],
        大连市: [121.621391, 38.919345],
        天津市: [117.205914, 39.090908],
        太原市: [112.55706, 37.876885],
        威海市: [122.128245, 37.519322],
        宁波市: [121.556686, 29.880177],
        宝鸡市: [107.243899, 34.367747],
        宿迁市: [118.282062, 33.967686],
        常州市: [119.980142, 31.816791],
        广州市: [113.270793, 23.135308],
        廊坊市: [116.69034, 39.54352],
        延安市: [109.496361, 36.591003],
        张家口市: [114.894165, 40.830172],
        徐州市: [117.29235, 34.210143],
        德州市: [116.365825, 37.441313],
        惠州市: [114.423348, 23.116409],
        成都市: [104.071216, 30.576279],
        扬州市: [119.419107, 32.39986],
        承德市: [117.969798, 40.957855],
        拉萨市: [91.121025, 29.650088],
        无锡市: [120.318954, 31.496704],
        日照市: [119.533606, 35.422798],
        昆明市: [102.839667, 24.885953],
        杭州市: [120.161693, 30.280059],
        枣庄市: [117.328513, 34.816569],
        柳州市: [109.42198, 24.331519],
        株洲市: [113.140431, 27.833737],
        武汉市: [114.311831, 30.598428],
        汕头市: [116.688739, 23.359289],
        江门市: [113.088165, 22.584459],
        沈阳市: [123.438973, 41.811339],
        沧州市: [116.845272, 38.31022],
        河源市: [114.707097, 23.749829],
        泉州市: [118.682316, 24.880242],
        泰安市: [117.094893, 36.205905],
        泰州市: [119.932115, 32.4612],
        济南市: [117.001319, 36.671627],
        济宁市: [116.593852, 35.420269],
        海口市: [110.206424, 20.050057],
        淄博市: [118.061254, 36.819182],
        淮安市: [119.022429, 33.616272],
        深圳市: [114.066112, 22.548515],
        清远市: [113.062619, 23.688238],
        温州市: [120.705869, 28.001095],
        渭南市: [109.516739, 34.505687],
        湖州市: [120.094566, 30.899015],
        湘潭市: [112.950575, 27.83585],
        滨州市: [117.9792, 37.388387],
        潍坊市: [119.168138, 36.713212],
        烟台市: [121.454425, 37.469868],
        玉溪市: [102.5537, 24.357512],
        珠海市: [113.583235, 22.276392],
        盐城市: [120.168187, 33.355301],
        盘锦市: [122.077269, 41.125939],
        石家庄市: [114.520828, 38.048684],
        福州市: [119.302938, 26.080447],
        秦皇岛市: [119.606184, 39.941259],
        绍兴市: [120.586673, 30.036519],
        聊城市: [115.992077, 36.462681],
        肇庆市: [112.47177, 23.052984],
        舟山市: [122.214339, 29.991092],
        苏州市: [120.589613, 31.304566],
        莱芜市: [117.683221, 36.219357],
        菏泽市: [115.487696, 35.239435],
        营口市: [122.241475, 40.672565],
        葫芦岛市: [120.843388, 40.717364],
        衡水市: [115.676942, 37.745166],
        衢州市: [118.880768, 28.941661],
        西宁市: [101.784269, 36.623477],
        西安市: [108.946306, 34.347436],
        贵阳市: [106.636816, 26.652747],
        连云港市: [119.229571, 34.602342],
        邢台市: [114.510889, 37.076646],
        邯郸市: [114.545808, 36.631222],
        郑州市: [113.631349, 34.753488],
        鄂尔多斯市: [109.787314, 39.61463],
        重庆市: [106.557165, 29.570997],
        金华市: [119.654027, 29.084455],
        铜川市: [108.951558, 34.902957],
        银川市: [106.238976, 38.492392],
        镇江市: [119.431494, 32.195688],
        长春市: [125.33017, 43.82178],
        长沙市: [112.945333, 28.233971],
        长治市: [113.123046, 36.201585],
        阳泉市: [113.587087, 37.86234],
        青岛市: [120.389445, 36.072358],
        韶关市: [113.603757, 24.816174],
        九江市: [116.007993, 29.711328],
        大庆市: [125.109727, 46.593216],
        宁德市: [119.554701, 26.671748],
        忻州市: [112.740804, 38.422382],
        石嘴山市: [106.39078, 38.989783],
        池州市: [117.497839, 30.67098],
        淮南市: [117.006189, 32.631837],
        宜昌市: [111.292971, 30.697602],
        景德镇市: [117.184967, 29.274337],
        安庆市: [117.070127, 30.548594],
        白城市: [122.845302, 45.6254],
        萍乡市: [113.86077, 27.62897],
        抚州市: [116.364627, 27.953603],
        朝阳市: [120.457301, 41.579487],
        海东市: [102.003965, 36.406412],
        鹰潭市: [117.075765, 28.265879],
        阿拉善盟: [105.735357, 38.857806],
        大阪府: [0, 0],
        鹤岗市: [130.304284, 47.356043],
        吴忠市: [106.205161, 38.003863],
        石河子市: [86.085507, 44.312423],
        开封市: [114.313904, 34.802941],
        白银市: [104.144182, 36.550821],
        吕梁市: [111.148086, 37.525476],
        随州市: [113.389071, 31.696341],
        雅安市: [103.04636, 30.021277],
        平顶山市: [113.198935, 33.772051],
        阜新市: [121.676518, 42.027983],
        普洱市: [100.98114, 22.788486],
        三亚市: [109.518646, 18.258217],
        赣州市: [114.94126, 25.837179],
        广元市: [105.849993, 32.441808],
        锦州市: [121.133631, 41.100869],
        南充市: [106.117231, 30.843297],
        衡阳市: [112.578397, 26.899517],
        齐齐哈尔市: [123.924531, 47.360087],
        兴安盟市: [122.044544, 46.088444],
        乌海市: [106.80185, 39.660154],
        伊春市: [128.84704, 47.733329],
        陇南市: [104.928233, 33.406825],
        荆门市: [112.205843, 31.041792],
        辽源市: [125.150107, 42.8943],
        怀化市: [110.008116, 27.575595],
        牡丹江市: [129.638976, 44.558647],
        湛江市: [110.365494, 21.277163],
        天水市: [105.731276, 34.587162],
        云浮市: [112.051045, 22.921154],
        安康市: [109.03592, 32.690575],
        吉安市: [115.00027, 27.119751],
        黄石市: [115.045433, 30.205336],
        宿州市: [116.970454, 33.652034],
        茂名市: [110.931773, 21.669051],
        阳江市: [111.989051, 21.864421],
        信阳市: [114.099264, 32.153186],
        三门峡市: [111.206832, 34.778442],
        咸宁市: [114.328967, 29.847123],
        许昌市: [113.858804, 34.041737],
        保山市: [99.168373, 25.117882],
        鹤壁市: [114.304044, 35.752656],
        运城市: [111.013379, 35.032587],
        达州市: [107.474504, 31.214347],
        常德市: [111.704994, 29.037723],
        酒泉市: [98.500427, 39.738615],
        马鞍山市: [118.512691, 31.67633],
        南阳市: [112.535009, 32.996701],
        邵阳市: [111.474133, 27.245167],
        孝感市: [113.922962, 30.930712],
        安顺市: [105.952622, 26.259904],
        辽阳市: [123.243726, 41.274452],
        克拉玛依市: [84.89587, 45.585765],
        庆阳市: [107.649305, 35.716096],
        呼伦贝尔市: [119.77221, 49.217977],
        六盘水市: [104.836786, 26.599086],
        新余市: [114.923664, 27.823541],
        七台河市: [131.009618, 45.776512],
        商丘市: [115.662798, 34.420378],
        漯河市: [114.02323, 33.587703],
        乌兰察布市: [113.140223, 40.999972],
        潜江市: [112.905773, 30.407633],
        定西市: [104.631662, 35.587354],
        鸡西市: [130.976161, 45.300906],
        汕尾市: [115.381693, 22.791322],
        四平市: [124.356844, 43.172447],
        遂宁市: [105.599152, 30.539156],
        商洛市: [109.94688, 33.876525],
        六安市: [116.529651, 31.741226],
        张家界市: [110.484925, 29.122477],
        潮州市: [116.62943, 23.662923],
        蚌埠市: [117.395835, 32.921498],
        桂林市: [110.296442, 25.279893],

        驻马店市: [114.029465, 33.017546],
        林芝地区市: [94.368109, 29.654792],
        百色市: [106.624969, 23.907845],
        鞍山市: [123.000974, 41.114122],
        郴州市: [113.021311, 25.776711],
        巴中市: [106.753912, 31.872851],

        十堰市: [110.80454, 32.635042],
        临沧市: [100.10566, 23.914336],
        泸州市: [105.449092, 28.877577],
        平凉市: [106.671741, 35.549266],
        宣城市: [118.765196, 30.946576],
        绵阳市: [104.686164, 31.473364],
        佳木斯市: [130.32696, 46.806581],
        遵义市: [106.933658, 27.731749],
        钦州市: [108.66089, 21.985392],

        本溪市: [123.773468, 41.299847],
        朔州市: [112.438184, 39.33789],
        毕节市: [105.333323, 27.408562],
        张掖市: [100.456221, 38.932187],
        南平市: [118.1843, 26.647662],
        濮阳市: [115.035917, 35.767586],
        宜宾市: [104.648103, 28.75761],
        铜仁市: [109.168558, 27.674903],
        松原市: [124.831633, 45.147201],
        漳州市: [117.653827, 24.519197],
        梧州市: [111.285647, 23.482873],
        洛阳市: [112.460033, 34.624376],
        龙岩市: [117.023668, 25.081257],
        莆田市: [119.014232, 25.45996],
        济源市: [112.609314, 35.072867],
        昭通市: [103.723311, 27.344057],
        黑河市: [127.535014, 50.251193],
        吉林市: [126.556073, 43.843512],
        广安市: [106.639772, 30.461708],
        黄山市: [118.174807, 30.133213],
        德阳市: [104.404319, 31.133105],
        河池市: [108.091898, 24.698828],
        益阳市: [112.361677, 28.559818],
        通化市: [125.946506, 41.733906],
        永州市: [111.618703, 26.426612],
        周口市: [114.703433, 33.631958],
        梅州市: [116.129179, 24.294311],

        固原市: [106.24917, 36.021609],
        滁州市: [118.323252, 32.308165],
        荆州市: [112.24722, 30.340606],
        芜湖市: [118.439561, 31.358798],
        襄阳市: [112.250093, 32.229169],
        榆林市: [109.741195, 38.290886],
        玉林市: [110.18743, 22.660656],
        鄂州市: [114.901557, 30.396522],
        晋中市: [112.759375, 37.692757],
        澳门市: [113.549403, 22.192961],
        内江市: [105.065028, 29.585836],
        揭阳市: [116.37922, 23.555773],
        通辽市: [122.251207, 43.658363],
        阜阳市: [115.821389, 32.895879],
        中卫市: [105.203332, 37.506058],
        铜陵市: [117.818795, 30.950899],
        曲靖市: [103.802685, 25.496328],
        香港: [114.171994, 22.281089],
        汉中市: [107.030197, 33.07382],
        乐山市: [103.77193, 29.558141],
        新乡市: [113.933349, 35.308973],
        晋城市: [112.857706, 35.496081],
        巴彦淖尔市: [107.394129, 40.749427],
        武威市: [102.644524, 37.934078],
        岳阳市: [113.135679, 29.363262],
        赤峰市: [118.895463, 42.264586],
        白山市: [126.431052, 41.94643],
        攀枝花市: [101.725262, 26.588109],
        黄冈市: [114.878872, 30.459422],
        绥化市: [126.975678, 46.658789],
        双鸭山市: [131.165442, 46.652966],
        安阳市: [114.3996, 36.103649],
        三明市: [117.645742, 26.269683],
        宜春市: [114.422683, 27.820089],
        上饶市: [117.950028, 28.460864],
        自贡市: [104.784891, 29.345379],
        娄底市: [112.001082, 27.703196],
        丽江市: [100.23357, 26.862521],
        防城港市: [108.361138, 21.693439],
        淮北市: [116.804878, 33.96064],
        儋州市: [109.587145, 19.527081],
        怒江州市: [98.863189, 25.823736],
        焦作市: [113.248557, 35.221493],
        铁岭市: [123.848797, 42.292573],
        抚顺市: [123.963595, 41.886078],
        巢湖市: [117.88049, 31.608733],
        西双版纳: [100.803836, 22.013792],
        德宏州: [98.591419, 24.438031],
        恩施: [109.485727, 30.30089],
        湘西州: [109.745507, 28.317399],
        西昌市: [102.269526, 27.900601],
        阿坝州: [102.231186, 31.905609],
        黔南州: [107.528663, 26.260586],
        黔东南州: [107.990602, 26.589858],
        黔西南州: [104.910858, 25.095974],
        大理州: [100.274223, 25.612206],
        红河州: [103.38215, 23.369914],
        文山州: [104.221606, 23.404187],
        楚雄州: [101.534082, 25.051226],
        迪庆州: [99.70948, 27.825264],
        山南地区: [91.779601, 29.24309],
        那曲地区: [92.0578, 31.482375],
        临夏州: [103.217303, 35.607475],
        甘南州: [102.917605, 34.98901],
        格尔木市: [94.909745, 36.408588],
        奎屯市: [84.90832, 44.432645],
        亳州市: [115.7786, 33.8445],
        崇左市: [107.3647, 22.3765],
        定安县市: [110.3588, 19.6814],
        东方市: [108.6518, 19.0953],
        贵港市: [109.5989, 23.1115],
        贺州市: [111.5666, 24.4035],
        嘉峪关市: [98.2891, 39.7731],
        金昌市: [102.1880, 38.5200],
        来宾市: [109.2214, 23.7503],
        眉山市: [103.8485, 30.0754],
        琼海市: [110.4921, 19.2396],
        台湾市: [120.9605, 23.6978],
        天门市: [113.3169, 30.8657],
        屯昌县市: [110.1034, 19.3517],
        万宁市: [110.3816, 18.8078],
        文昌市: [113.8259, 25.8228],
        五指山市: [109.5169, 18.7751],
        仙桃市: [113.4234, 30.3608],
        资阳市: [104.6520, 30.1246],
        黔西南布依族苗族自治州: [104.910858, 25.095974],
        恩施土家族苗族自治州: [109.494763, 30.277908],
        黔南布依族苗族自治州: [107.528663, 26.260586],
        锡林郭勒盟: [116.054141, 43.939525],
        哈密地区: [93.522785, 42.824642],
        甘南藏族自治州: [102.917605, 34.98901],
        海南藏族自治州: [100.626831, 36.292132],
        文山壮族苗族自治州: [104.221606, 23.404187],
        玉树藏族自治州: [97.01308, 33.011061],
        西双版纳傣族自治州: [100.803836, 22.013792],
        果洛藏族自治州: [100.251341, 34.477207],
        临夏回族自治州: [103.217303, 35.607475],
        大理白族自治州: [100.274223, 25.612206],
        昌吉回族自治州: [87.314822, 44.016923],
        迪庆藏族自治州: [99.70948, 27.825264],
        红河哈尼族彝族自治州: [103.38215, 23.369914],
        巴音郭楞蒙古自治州: [86.151584, 41.770226],
        凉山彝族自治州: [102.273965, 27.887685],
        伊犁哈萨克自治州: [81.330697, 43.922815],
        德宏傣族景颇族自治州: [98.591419, 24.438031],
        博尔塔拉蒙古自治州: [82.073064, 44.912168],
        乐东黎族自治县: [109.1730, 18.7502],
        陵水黎族自治县: [110.0375, 18.5060],
        楚雄彝族自治州: [101.534082, 25.051226],
        黄南藏族自治州: [102.021495, 35.526125],
        黔东南苗族侗族自治州: [107.990602, 26.589858],
        吐鲁番地区: [89.196029, 42.957303],
        怒江傈僳族自治州: [98.863189, 25.823736],
        湘西土家族苗族自治州: [109.745507, 28.317399],
        延边朝鲜族自治州: [129.515602, 42.897211],
        日喀则地区: [88.956063, 29.26816],
        海北藏族自治州: [100.907395, 36.960702],
        海西蒙古族藏族自治州: [97.377823, 37.382839],
        // 安徽: [117.17, 31.52],
        // 福建: [119.18, 26.05],
        // 甘肃: [103.51, 36.04],
        // 广东: [113.14, 23.08],
        // 广西: [108.19, 22.48],
        // 贵州: [106.42, 26.35],
        // 海南: [110.20, 20.02],
        // 河北: [114.30, 38.02],
        // 河南: [113.40, 34.46],
        // 黑龙江: [126.36, 45.44],
        // 湖北: [114.17, 30.35],
        // 湖南: [112.59, 28.12],
        // 江苏: [118.46, 32.03],
        // 江西: [115.55, 28.40],
        // 辽宁: [123.25, 41.48],
        // 内蒙古: [111.41, 40.48],
        // 宁夏: [106.16, 38.27],
        // 青海: [101.48, 36.38],
        // 山东: [117.00, 36.40],
        // 山西: [112.33, 37.54],
        // 陕西: [108.57, 34.17],
        // 四川: [104.04, 30.40],
        // 西藏: [91.08, 29.39],
        // 新疆: [87.36, 43.45],
        // 云南: [102.42, 25.04],
        // 浙江: [120.10, 30.16],
    }
    return Object.keys(city);
}
export default util;
